# データマイニング入門
# Pythonの基礎

## pandasライブラリ
**pandas**ライブラリにはデータ分析作業を支援するためのモジュールが含まれています。以下では、pandasライブラリのモジュールの基本的な使い方について説明します。

pandasライブラリを使用するには、まず`pandas`モジュールをインポートします。慣例として、同モジュールを`pd`と別名をつけてコードの中で使用します。

In [17]:
import pandas as pd

## シリーズとデータフレーム
pandasは、リストや辞書などのデータを**シリーズ**(**Series**)あるいは**データフレーム**(**DataFrame**)のオブジェクトとして保持します。シリーズは列、データフレームは複数の列で構成されます。シリーズやデータフレームの行は**インデックス**`index`で管理され、インデックスには0から始まる番号、または任意のラベルが付けられています。シリーズやデータフレームは、インデックスをキー、各行を値とした辞書とみなすことができます。

## シリーズ（Series）の作成
シリーズのオブジェクトは、以下のように、リストや辞書から作成することができます。また、Numpyの配列からもシリーズやオブジェクトを作成することができます。

In [18]:
# リストからシリーズの作成
s1 = pd.Series([0,1,2,3,4,5])
print(s1)

# 辞書からシリーズの作成
s2 = pd.Series({0:'boo',1:'foo',2:'woo'})
print(s2)

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64
0    boo
1    foo
2    woo
dtype: object

以下では、シリーズ（列）より一般的なデータフレームの操作と機能について説明していきますが、データフレームオブジェクトの多くの操作や機能はシリーズオブジェクトにも適用できます。

## データフレーム（DataFrame）の作成
データフレームのオブジェクトは、以下のように、リストや辞書、NumPyの配列から作成することができます。行のラベルは、`DataFrame`の`index`引数で指定できますが、以下のデータフレーム作成の例、d2, では同インデックスを省略しているため、０から始まるインデックス番号がラベルとして行に自動的に付けられます。列のラベルは`columns`引数で指定します。辞書からデータフレームを作成する際は、`columns`引数で列の順番を指定することになります。

In [19]:
# 多次元リストからデータフレームの作成
d1 = pd.DataFrame([[0,1,2],[3,4,5],[6,7,8],[9,10,11]], index=[10,11,12,13], columns=['c1','c2','c3'])
print(d1)

# 辞書からデータフレームの作成
d2 = pd.DataFrame({'Initial':['B','F','W'], 'Name':['boo', 'foo', 'woo']}, columns=['Name','Initial'])
print(d2)

    c1  c2  c3
10   0   1   2
11   3   4   5
12   6   7   8
13   9  10  11
  Name Initial
0  boo       B
1  foo       F
2  woo       W

## csvファイルからのデータフレームの作成
`pandas`の`read_csv()`関数を用いて、以下のように**csvファイル**を読み込んで、データフレームのオブジェクトを作成することができます。`read_csv()`関数の`encoding`引数にはファイルの文字コードを指定します。csvファイル"simple_score.csv"には、以下のようにuserのID(user)、国語の点数（kokugo）、社会の点数（shakai）、数学の点数（sugaku）、理科の点数（rika）のデータが1行ずつ含まれています。
```Python
## simple_score.csv
user, kokugo, shakai, sugaku, rika
1, 30, 43, 51, 63
2, 39, 21, 49, 56
...
```
`head()`関数を使うとデータフレームの先頭の複数行を表示させることができます。引数には表示させたい行数を指定し、行数を指定しない場合は、5行分のデータが表示されます。

In [20]:
# csvファイルの読み込み
df = pd.read_csv('simple_score.csv')

# 先頭3行のデータを表示
df.head(3)

   user  kokugo  shakai  sugaku  rika
0     1      30      43      51    63
1     2      39      21      49    56
2     3      29      30      23    57

データフレームオブジェクトの`index`属性により、データフレームのインデックスの情報が確認できます。`len()`関数を用いると、データフレームの行数が取得できます。

In [21]:
print(df.index) #インデックスの情報
len(df.index) #インデックスの長さ

RangeIndex(start=0, stop=5, step=1)

5

## データの参照
シリーズやデータフレームでは、行の位置（行は0から始まります）を**スライス**として指定することで任意の行を抽出することができます。

In [22]:
# データフレームの先頭3行のデータ
df[:3]

   user  kokugo  shakai  sugaku  rika
0     1      30      43      51    63
1     2      39      21      49    56
2     3      29      30      23    57

## 練習
データフレーム`df`の終端2行のデータをスライスを使って抽出してください

データフレームから任意の列を抽出するには、`DataFrame.列名`のように、データフレームオブジェクトに'.'で列名をつなげることで、その列を指定してシリーズオブジェクトとして抽出することができます。なお、列名を文字列として、`DataFrame['列名']`のように添字指定しても同様です。

In [23]:
# データフレームの'sugaku'の列の先頭3行のデータ
df['sugaku'].head(3)

0    51
1    49
2    23
Name: sugaku, dtype: int64

データフレームの添字として、列名のリストを指定すると複数の列をデータフレームオブジェクトとして抽出することができます。

In [24]:
# データフレームの'user'と'sugaku'の列の先頭3行のデータ
df[['user','sugaku']].head(3)

   user  sugaku
0     1      51
1     2      49
2     3      23

## 練習
データフレーム`df`の'user'と'rika'の列の先頭3行のデータを抽出してください

### ilocとloc
データフレームオブジェクトの**`iloc`**属性を用いると、行と列の位置を指定して任意の行と列を抽出することができます。

In [25]:
# データフレームの2行目のデータ
df.iloc[1]

user       2
kokugo    39
shakai    21
sugaku    49
rika      56
Name: 1, dtype: int64

In [26]:
# データフレームの2行,2列目のデータ
df.iloc[1, 1]

39

In [27]:
# データフレームの1から2行目,1から2列目のデータ
df.iloc[0:2, 0:2]

   user  kokugo
0     1      30
1     2      39

データフレームオブジェクトの**`loc`**属性を用いると、抽出したい行のインデックス・ラベルや列のラベルを指定して任意の行と列を抽出することができます。複数のラベルはリストで指定します。行のインデックスは各行に割当てられた番号で、`iloc`で指定する行の位置とは必ずしも一致しないことに注意してください。

In [28]:
# データフレームの行インデックス1のデータ
df.loc[1]

user       2
kokugo    39
shakai    21
sugaku    49
rika      56
Name: 1, dtype: int64

In [29]:
# データフレームの行インデックス2と'sugakuと列のデータ
df.loc[2, 'sugaku']

23

In [30]:
# データフレームの行インデックス0から1と'user'と'kokugo'の列のデータ
df.loc[0:1, ['user','sugaku']]

   user  sugaku
0     1      51
1     2      49

## 練習
データフレーム`df`の3から4行目,1列目と5列目のデータを`iloc`, `loc`それぞれを使って抽出してください

## データの条件取り出し
データフレームの列の指定と併せて条件を指定することで、条件にあった行からなるデータフレームを抽出することができます。条件式のブール演算では、`and`、`or`、`not`の代わりに`&`、`|`、`~`を用います。

In [31]:
# データフレームの'sugaku'列の値が50より大きく、'rika'列の値が50より大きいデータ
df[(df['sugaku'] > 50) & (df['rika'] > 50)]

   user  kokugo  shakai  sugaku  rika
0     1      30      43      51    63
3     4      95      87      77   100
4     5      70      71      78    67

## 練習
データフレーム`df`から`kokugo`と`shakai`がどちらとも50点以上でのデータを抽出してください

## 列の追加と削除
データフレームに列を追加する場合は、以下のように、追加したい新たな列名を指定し、シリーズ、リストやNumPyの配列を代入すると新たな列を追加できます。

In [32]:
# データフレームに'eigo'という列を追加
df['eigo']=[50,50,60,60,60]

# データフレームに'ongaku'という列を追加
df['ongaku']=pd.Series([40,50,60,70,80])
df

   user  kokugo  shakai  sugaku  rika  eigo  ongaku
0     1      30      43      51    63    50      40
1     2      39      21      49    56    50      50
2     3      29      30      23    57    60      60
3     4      95      87      77   100    60      70
4     5      70      71      78    67    60      80

**`del`**ステートメントを用いると、以下のようにデータフレームから任意の列を削除できます。

In [33]:
# データフレームから'ongaku'という列を削除
del df['ongaku']
df

   user  kokugo  shakai  sugaku  rika  eigo
0     1      30      43      51    63    50
1     2      39      21      49    56    50
2     3      29      30      23    57    60
3     4      95      87      77   100    60
4     5      70      71      78    67    60

**`assign`**`()`メソッドを用いると、追加したい列名とその値を指定することで、以下のように新たな列を追加したデータフレームを新たに作成することができます。この際、元のデータフレームは変更されないことに注意してください。

In [34]:
# データフレームに'mycolumn'という列を追加し新しいデータフレームを作成
df1 = df.assign(ongaku=pd.Series([40,50,60,70,80]))
df1

   user  kokugo  shakai  sugaku  rika  eigo  ongaku
0     1      30      43      51    63    50      40
1     2      39      21      49    56    50      50
2     3      29      30      23    57    60      60
3     4      95      87      77   100    60      70
4     5      70      71      78    67    60      80

**`drop`**`()`メソッドを用いると、削除したい列名を指定することで、以下のように任意の列を削除したデータフレームを新たに作成することができます。列を削除する場合は、`axis`引数に1を指定します。この際、元のデータフレームは変更されないことに注意してください。

In [35]:
# データフレームから'mycolumn'という列を削除し、新しいデータフレームを作成
df2 = df1.drop('ongaku',axis=1)
df2

   user  kokugo  shakai  sugaku  rika  eigo
0     1      30      43      51    63    50
1     2      39      21      49    56    50
2     3      29      30      23    57    60
3     4      95      87      77   100    60
4     5      70      71      78    67    60

## 練習
データフレーム`df2`に新たな列を追加して新しいデータフレームを作成してください

## 行の追加と削除
`pandas`モジュールの**`append`**`()`関数を用いると、元のデータフレームに新たな行を追加した新たなデータフレームを作成することができます。以下では、`df`データフレームの最終行に新たな行を追加し、新たなデータフレームを作成しています。`ignore_index`引数をTrueにすると追加した行に新たなインデックス番号がつけられます。

In [36]:
# 追加する行のデータフレーム
row = pd.DataFrame([[6,10,20,30,40,50]], columns=df.columns)

# データフレームに行を追加し新しいデータフレームを作成
df3 = df.append(row, ignore_index=True)
df3

   user  kokugo  shakai  sugaku  rika  eigo
0     1      30      43      51    63    50
1     2      39      21      49    56    50
2     3      29      30      23    57    60
3     4      95      87      77   100    60
4     5      70      71      78    67    60
5     6      10      20      30    40    50

**`drop`**`()`メソッドを用いると、行のインデックスまたはラベルを指定することで行を削除することもできます。この時に、`axis`引数は省略することができます。

In [37]:
# データフレームから行インデックス5の行を削除し、新しいデータフレームを作成
df4 = df3.drop(5)
df4

   user  kokugo  shakai  sugaku  rika  eigo
0     1      30      43      51    63    50
1     2      39      21      49    56    50
2     3      29      30      23    57    60
3     4      95      87      77   100    60
4     5      70      71      78    67    60

## 練習
データフレーム`df4`に新たな行を追加して新しいデータフレームを作成してください

## データの並び替え
データフレームオブジェクトの**`sort_index()`**メソッドで、データフレームのインデックスに基づくソートができます。また、**`sort_values()`**メソッドで、任意の列の値によるソートができます。列は複数指定することもできます。いずれのメソッドでも、`inplace`引数により、ソートにより新しいデータフレームを作成する（False）か、元のデータフレームを更新する（True)を指定できます。デフォルトは`inplace`はFalseになっており、`sort_index()`メソッドは新しいデータフレームを作成します。

In [38]:
# データフレームの2つ列の値に基づいて昇順にソート
df5 = df.sort_values(['eigo', 'sugaku'])
df5

   user  kokugo  shakai  sugaku  rika  eigo
1     2      39      21      49    56    50
0     1      30      43      51    63    50
2     3      29      30      23    57    60
3     4      95      87      77   100    60
4     5      70      71      78    67    60

列の値で降順にソートする場合は、`sort_values()`メソッドの`ascending`引数をFalseにしてください。

In [39]:
# データフレームの2つ列の値に基づいて降順にソート
df6 = df.sort_values(['eigo', 'sugaku'],ascending=False)
df6

   user  kokugo  shakai  sugaku  rika  eigo
4     5      70      71      78    67    60
3     4      95      87      77   100    60
2     3      29      30      23    57    60
0     1      30      43      51    63    50
1     2      39      21      49    56    50

## 練習
データフレーム`df6`を`eigo`と`rika`の列の値に基づいて降順に並び替えて新しいデータフレーム作成してください

## データの統計量
データフレームオブジェクトの**`describe()`**メソッドで、データフレームの各列の要約統計量を求めることができます。要約統計量には平均、標準偏差、最大値、最小値などが含まれます。その他の統計量を求める`pandas`モジュールのメソッドは以下を参照してください。

[pandasでの統計量計算](https://pandas.pydata.org/pandas-docs/stable/api.html#api-dataframe-stats)

In [40]:
# データフレームの各数値列の要約統計量を表示
df.describe()

           user     kokugo     shakai     sugaku        rika       eigo
count  5.000000   5.000000   5.000000   5.000000    5.000000   5.000000
mean   3.000000  52.600000  50.400000  55.600000   68.600000  56.000000
std    1.581139  28.953411  27.835229  22.842942   18.119051   5.477226
min    1.000000  29.000000  21.000000  23.000000   56.000000  50.000000
25%    2.000000  30.000000  30.000000  49.000000   57.000000  50.000000
50%    3.000000  39.000000  43.000000  51.000000   63.000000  60.000000
75%    4.000000  70.000000  71.000000  77.000000   67.000000  60.000000
max    5.000000  95.000000  87.000000  78.000000  100.000000  60.000000

## 練習
データフレーム`df`の各列ごと値の和を求めてください

## データの連結
`pandas`モジュールの**`concat`**`()`関数を用いると、データフレームを連結して新たなデータフレームを作成することができます。以下では、`df`データフレームの先頭2行と最終2行を連結して、新しいデータフレームを作成しています。

In [41]:
# データフレームの先頭2行と最終2行を連結
concat_row_df = pd.concat([df[:2],df[-2:]])
concat_row_df

   user  kokugo  shakai  sugaku  rika  eigo
0     1      30      43      51    63    50
1     2      39      21      49    56    50
3     4      95      87      77   100    60
4     5      70      71      78    67    60

`concat()`関数の`axis`引数に1を指定すると、以下のように、データフレームを列方向にすることができます。

In [42]:
# データフレームの'user'列と'sugaku'列を連結
concat_column_df = pd.concat([df.loc[:, ['user']],df.loc[:, ['sugaku']]], axis=1)
concat_column_df.head(10)

   user  sugaku
0     1      51
1     2      49
2     3      23
3     4      77
4     5      78

## データの結合
`pandas`モジュールの**`merge`**`()`関数を用いると、任意の列の値をキーとして異なるデータフレームを結合することができます。結合のキーとする列名は`on`引数で指定します。以下では、まずデータフレーム`user_df`を作成し、2つのデータフレーム、`user_df`と`df`、に共通の'user'の列の値をキーに、2つのデータフレームを結合して新しいデータフレーム`score_df`を作成しています。

In [43]:
user_df = pd.DataFrame({'user':[1,2,3,4,5], 'name':['Paul', 'John', 'Ringo','Georgi','Yoko'],\
                        'class':['A', 'A', 'A','B','B']}, \
                        columns=['user','name', 'class'])
user_df

   user    name class
0     1    Paul     A
1     2    John     A
2     3   Ringo     A
3     4  Georgi     B
4     5    Yoko     B

In [44]:
# dfとuser_dfを'user'をキーにして結合
score_df = pd.merge(df, user_df, on='user')
score_df

   user  kokugo  shakai  sugaku  rika  eigo    name class
0     1      30      43      51    63    50    Paul     A
1     2      39      21      49    56    50    John     A
2     3      29      30      23    57    60   Ringo     A
3     4      95      87      77   100    60  Georgi     B
4     5      70      71      78    67    60    Yoko     B

## 練習
以下のデータフレームとデータフレーム`df`を'user'列の値をキーにして結合して新たなデータフレームを作成してくだい

In [45]:
campus_df = pd.DataFrame({'user':[1,2,3,4,5], 'campus':['Komaba', 'Komaba', 'Hongo','Hongo','Hongo']}, columns=['user','campus'])
campus_df

   user  campus
0     1  Komaba
1     2  Komaba
2     3   Hongo
3     4   Hongo
4     5   Hongo

## データのグループ化
データフレームオブジェクトの**`groupby`**`()`メソッドを使うと、データフレームの任意の列の値に基づいて、同じ値を持つ行をグループにまとめることができます。列は複数指定することもできます。`groupby()`メソッドを適用するとグループ化オブジェクト（DataFrameGroupBy)が作成されますが、データフレームと同様の操作を多く適用することができます。

In [46]:
# データフレームの'class'の値で行をグループ化
score_df.groupby('class')

In [47]:
# グループごとの先頭2行を表示
score_df.groupby('class').head(2)

   user  kokugo  shakai  sugaku  rika  eigo    name class
0     1      30      43      51    63    50    Paul     A
1     2      39      21      49    56    50    John     A
3     4      95      87      77   100    60  Georgi     B
4     5      70      71      78    67    60    Yoko     B

In [ ]:
# グループごとの"sugaku"列,"rika"列の値の平均を表示
score_df.groupby('class')[["sugaku","rika"]].mean()

## 練習
データフレーム`score_df`で'class'ごとの'kokugo'と'shakai'の平均を求めてください